{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentParameters.json#",
  "contentVersion": "1.0.0.0",
  "parameters": 
    "displayname": {
      "value": "test123"
    },
    "query": {
      "value": "OfficeActivity | where OfficeWorkload =~ \"MicrosoftTeams\" | where Operation =~ \"BotAddedToTeam\" | summarize Start=max(TimeGenerated), End=min(TimeGenerated), Teams = makeset(TeamName) | extend CountOfTeams = array_length(Teams) | extend TimeDelta = End - Start | where CountOfTeams > threshold | where TimeDelta >= time_threshold | project Start, End, Teams, CountOfTeams | extend timestamp = Start"
    },
    "tactics": {
      "value": "Access"
    }
  }
}
