{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
    "resources": [
        {
            "type": "Microsoft.OperationalInsights/workspaces/savedSearches",
            "apiVersion": "2021-09-01-preview",
            "name": "esempio1",
            "properties": {
                "etag": "*",
                "Category": "Hunting Queries",
                "DisplayName": "esempio1", 
                "Query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
                "Tags": [
                    {
                        "Name": "description",
                        "Value": "Demo"
                    },
                    {
                        "Name": "tactics",
                        "Value": "Execution"
                    }
                ]
            }
        }
    ],
}
}
