{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
"id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/savedSearches/7beb89a6-8dd1-46fd-bbb1-7ca094d7f33f')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7beb89a6-8dd1-46fd-bbb1-7ca094d7f33f')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/savedSearches/",
             "apiVersion": "2020-03-01-preview",
{
"properties": {
    "Category": "Hunting Queries",
    "DisplayName": "HuntingRule02",
    "Query": "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\"",
    "Tags": [
        { 
        "Name": "Description",
        "Value": "Test Hunting Query"
        },
        { 
        "Name": "Tactics",
        "Value": "Execution, Discovery"
        }
        ]        
    }
}
}
]
}
	
